import React, { useState } from "react"
import ChangeableText from "./ChangeableText";
class Content extends React.Component {
    constructor(props) {
      super(props);
      this.state = {
        active: true
      };
    }
    render(){
        return(
            <div>
                <p>22.10.2002, місто Ізмаїл</p>
                <p>Освіта: Ізмаїльский політехнічний ліцей, Київський політехнічний інститут імені Ігоря Сікорського</p>

                <p>Мої хоббі</p>
                <ul id="list">
                    <li>Читання</li>
                    <li>Хайкінг</li>
                    <li id="cooking"><ChangeableText> Кулінарія(click!)</ChangeableText></li>
                </ul>

                <p id="film"> <ChangeableText> Мої улюблені фільми(click!)</ChangeableText></p>
                <ol>
                    <li>Той, хто біжить по лезу</li>
                    <li>Казіно</li>
                    <li>Загадкова історія Бенджаміна Баттона</li>
                </ol>

                <p>
                    Брно (чеськ. Brno, нім. Brünn, лат. Bruna) — місто в Чехії, історичний центр Моравії. 
                    Друге за розміром місто країни після Праги. Брно - це жваве місто, розташоване в південно-східній частині Чехії. 
                    Воно славиться своєю багатою історією, архітектурним спадком та культурними подіями. 
                    Однією з головних архітектурних пам'яток міста є Брноський замок, де можна помилуватися видовищними краєвидами на місто. Брно також відоме своїми численними музеями, виставками та фестивалями, серед яких виділяється Фестиваль Архітектури та Фестиваль Музики та Театру. 
                    Місто пропонує багато можливостей для шопінгу та відпочинку в ресторанах та кафе, а також має активну нічне життя. Брно відоме своєю дружньою атмосферою та гостинними мешканцями, що робить його привабливим місцем для туристів та студентів.
                </p>
            </div>
        );
    }
}
export default Content;